{"data": [{"subreddit_name": "Concordia", "author": "vocalcow", "id": "g96jeal", "author_fullname": "t2_1d84t0j8", "score": 1, "body": "Even if you get sick, you will not die from it, mostly old people, so get some data and with it perspective       ( not from the left wing news sites, all they have is doom and gloom and that will give you anxiety) Uni is not there to coddle you, expect to receive from them education and turn to your loved ones for mental support. Don't gave up, people lived through wars and prevailed, think of someone who has it worse than you ....and weirdly you will feel better.", "subreddit_id": "t5_2rsnl", "created_utc": 1602995258}, {"subreddit_name": "Concordia", "author": "kristy9816", "id": "g96bmvh", "author_fullname": "t2_b60qw", "score": 1, "body": "I don't think anyone registered for this semester knowing there would this much workload, stress, and arguably/in some cases lower quality of education (profs not recording lectures and not being responsive/accessible to students, time zone restrictions, lack of social life etc.) while still paying full tuition. Sure, we registered knowing it would be online and that we'd all be mostly studying from home but I don't think anyone saw the amount of stress that this semester has brought. Keep in mind that there are also people who don't really have much of choice but to attend university because of things such as pressure from parents to get a higher education degree.", "subreddit_id": "t5_2rsnl", "created_utc": 1602991009}, {"subreddit_name": "Concordia", "author": "hardboiledbitch", "id": "g96904t", "author_fullname": "t2_45unn17y", "score": 1, "body": "I am a transfer student starting in the Winter who was supposed to start this semester. I submitted my FAFSA to Concorida in june and never got a response leaving me no choice but to defer 2 weeks before classes began. I needed the financial aid documents for my CAQ and I made them aware of that. Eventually too late to get CAQ and study permit solely because they slept on my application.", "subreddit_id": "t5_2rsnl", "created_utc": 1602989631}, {"subreddit_name": "Concordia", "author": "mano_cornuto", "id": "g968xny", "author_fullname": "t2_69m2sfro", "score": 1, "body": "First off, stop stressing. You shouldn't worry about your gpa. If you're concerned about future job prospects, employers don't care about your gpa; they value internship experience and personal development (i.e. a strong portfolio). If you're interested in grab school, those who review applications are interested in trends more than anything.   \n\n\nTo answer your question, a final grade of 85% is fantastic in most cases, and should net you at  the very least 3.3 gpa points.", "subreddit_id": "t5_2rsnl", "created_utc": 1602989595}, {"subreddit_name": "Concordia", "author": "starsky333", "id": "g95ogid", "author_fullname": "t2_a6ia6cj", "score": 1, "body": "I think your response is exactly how the administration has been dealing with  students inquiries, and this is why there are so many people going through mental breakdown. Blaming the students and telling them that we willingly decided to keep going to school  therefore, we just have to deal with double the course load and harder exams is farfetched. It would be great if students could get some form of leniency, during these hyper anxious times, especially for those who already had mental illness prior to covid.", "subreddit_id": "t5_2rsnl", "created_utc": 1602978917}]}