{"data": [{"subreddit_name": "montreal", "author": "Shryem", "author_fullname": "t2_gr5md", "id": "shzqui", "score": 1, "selftext": "im facing a social anxiety relapse and would like to join a club or activity in montreal that can help me get uncomfortable and force me to think fast. im openminded and dont like so much being behind a computer screen like zoom activities because one of my main issues is discomfort with expressing myself through my body. i dont know how limited activities are now given the pandemic but im just wondering whats out there. any suggestions.", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 187366, "created_utc": 1643734822, "num_comments": 0, "title": "clubsactivities in montreal to help with social anxiety.", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "WhimsicalCanadian", "author_fullname": "t2_aw7bslxm", "id": "s2mb7g", "score": 1, "selftext": "Je tente d'organiser un semblant de fête à ma copine en cette période de confinement. J'ai déjà des cadeaux et on organise un souper zoom avec sa famille en soirée, mais j'aimerais la sortir avec une activité durant la journée.\n\nJ'avais pensé l'apporter faire du patin sur un sentier glacé, mais je ne me trouve pas trop original. Est-ce que vous avez des activités exterieurs cool en tête qui sortiraient de l'habitude. Je cherche de l'inspiration plzzz\n\nMerciii d'avance", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 182497, "created_utc": 1642036034, "num_comments": 0, "title": "Fête à ma copine", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "Agitated_Base", "author_fullname": "t2_4ulh9yg8", "id": "s3jkei", "score": 1, "selftext": "(Le français suit ci-dessous)\n\nDoes anyone know if there is an in-person language exchange meetup in Montreal that is currently active? I know there are online language exchange meetups, but practicing over zoom just isn't the same. The covid lockdown restricts meeting at cafes, but meetups outside at the park or something should still be fine.  \n\nIn case someone is interested as an individual,  I'm looking to practice French and am a native English speaker so I can help with that. I'm also highly experienced in technical/scientific writing.\n\n\\-------------- traduction française (fait avec google translate, alors méfiez-vous des erreurs)-----------\n\nEst-ce que quelqu'un sait s'il y a une rencontre d'échange linguistique en personne à Montréal qui est actuellement active ? Je sais qu'il existe des rencontres d'échange linguistique en ligne, mais pratiquer le zoom n'est tout simplement pas la même chose. Le verrouillage covid limite les réunions dans les cafés, mais les rencontres à l'extérieur du parc ou quelque chose devraient toujours bien se passer.\n\nAu cas où quelqu'un serait intéressé en tant qu'individu, je cherche à pratiquer le français et je suis de langue maternelle anglaise, donc je peux aider avec ça. Je suis également très expérimenté dans la rédaction technique/scientifique.", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 182877, "created_utc": 1642135443, "num_comments": 0, "title": "Language exchange meetups", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "crushed_dreams", "author_fullname": "t2_a1nb0", "id": "tio4xp", "score": 1, "selftext": "hi i know this is a stupid thing to post about but im looking for peppermint ball candy and i just cant find any anywhere. the pinwheel peppermint candy is everywhere but i hate those. i think it must be a texture issue with me or something. any help is appreciated. thanks.", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 196176, "created_utc": 1647791900, "num_comments": 0, "title": "please help me find this peppermint candy.", "upvote_ratio": 1.0}]}