{"data": [{"subreddit_name": "montreal", "author": "lord_untuly", "id": "hy0qk7s", "author_fullname": "t2_ckw9zz10", "score": 2, "body": "Its mainly a game teenagers plays. Its basically a  confrontation to see who is gonna fold first and change direction. Psychological warfare type game. \n\nI'm just over 30 years old and use to do it all the time when I was in high school. \n\nNow I understand how stupid it is but not gonna lie I still do it sometimes just to make sure I still got it!!", "subreddit_id": "t5_2qnmr", "created_utc": 1645567002}, {"subreddit_name": "montreal", "author": "Rosuvastatine", "id": "hzy8nhp", "author_fullname": "t2_96oge6ml", "score": 18, "body": "\n&gt; Is it unfair for things that are simply connected to Russia to get cancelled regardless of their stance on the war? sure, but you know what else is unfair? Cluster bombing civilians, Putin loves waging asymmetrical warfare\n\nAh yes the good ole « But theres a war !! » anytime we  slightly criticize something that is supposed to be somewhat on Ukraines side.\n\nStop fucking seeing everything in binary. You guys lack so much nuance its crazy. Oh you dont like this soldier ? You must be okay with the bombing of Ukrainians ! Oh youre agaisnt the ban of a Russian young man ? How dare you not realize Ukrainians are getting killed !", "subreddit_id": "t5_2qnmr", "created_utc": 1646815029}, {"subreddit_name": "montreal", "author": "contrariancaribou", "id": "hzxq2hz", "author_fullname": "t2_3fiqf5gx", "score": -35, "body": "Cancelling a music concert and the internment camps isn’t even a comparison that should be made. \n\nIs it unfair for things that are simply connected to Russia to get cancelled regardless of their stance on the war? sure, but you know what else is unfair? Cluster bombing civilians, Putin loves waging asymmetrical warfare, lets not be surprised for there to be asymmetrical response in the form of boycotts.", "subreddit_id": "t5_2qnmr", "created_utc": 1646802089}, {"subreddit_name": "montreal", "author": "rdz_gaming", "id": "hzfhjmg", "author_fullname": "t2_6irn1kbt", "score": -14, "body": "Chances are it will go even higher. WW3 hasn't peaked yet and that is if the Ukraine conflict escalates to Nuclear warfare.\n\nEdit: Oh and for those celebrating this price increase because they B.M.W.\n When gaz price increase, everything increases cuz of how the supply chain relies on fuel to transport goods to the store you BMW to.", "subreddit_id": "t5_2qnmr", "created_utc": 1646467969}]}