{"data": [{"subreddit_name": "montreal", "author": "behaaki", "id": "hsfz5an", "author_fullname": "t2_3chn5", "score": 1, "body": "I’d check what the WHO says about that, maybe also the CDC, or an European equivalent.\n\nCheck multiple sources, see where they overlap. That’s probably as close to scientific truth as you’ll get.", "subreddit_id": "t5_2qnmr", "created_utc": 1642045959}, {"subreddit_name": "montreal", "author": "jerichojeudy", "id": "hsfv2is", "author_fullname": "t2_3jjkvkrl", "score": 1, "body": "I agree with that.\n\nI personally think omicron is good news, since its less potent. Priority should be on vaccinating and giving the rights tools to poor countries who have ridiculously low levels of vaccination due to simple lack of resources. \n\nBeyond that, we need to get our health system cleaned up and modernized, because it's so fragile, it can't handle any surge in admissions. It breaks down right away...", "subreddit_id": "t5_2qnmr", "created_utc": 1642044058}, {"subreddit_name": "montreal", "author": "Agreeable-Ask-7594", "id": "hsfpugn", "author_fullname": "t2_cnr09e4y", "score": 1, "body": "Same lol. I live in a small appartment, i’m not some rich fuck in a house who can workout properly at home", "subreddit_id": "t5_2qnmr", "created_utc": 1642041717}, {"subreddit_name": "montreal", "author": "BranchConsistent", "id": "hsfih2w", "author_fullname": "t2_3fwddvgp", "score": 1, "body": "What do you guys think about telling people who have just had Covid that they need to go and get their booster now too? I just had Covid over Xmas and I absolutely refuse to get my 3rd shot until at least 3 months, it’s pointless and could actually be harmful since your immune system is still recovering from Covid. 🤦🏽‍♀️\n\nhttps://ici.radio-canada.ca/nouvelle/1853611/vaccin-troisieme-dose-rendez-vous-clic-sante-covid-vaccination?fromApp=appInfoIos&amp;partageApp=appInfoiOS&amp;accesVia=partage", "subreddit_id": "t5_2qnmr", "created_utc": 1642038519}, {"subreddit_name": "montreal", "author": "bubeTUBE10", "id": "hsd5885", "author_fullname": "t2_4gevgk24", "score": 1, "body": "Yes definitely but some people like kids already have near zero chance of going to the ICU so in my opinion it doesn't make sense to vaccinate them to maybe  prevent a couple of ICU admissions especially because now with omicron the vaccine doesn't prevent spread. Also, there's many people who have gotten covid and had mild symptoms symptoms so they chose to not get vaccinated but the government is totally ignoring them. I think they should be focusing on people who are unvaccinated and at risk instead of lumping all the unvaccinated together.", "subreddit_id": "t5_2qnmr", "created_utc": 1642004808}]}