{"data": [{"subreddit_name": "mcgill", "author": "EraseNorthOfShrbroke", "id": "g96cdn7", "author_fullname": "t2_2wvomy4n", "score": 1, "body": "I heard going into research is pretty rough (esp. with only a Bachelor in Science). \n\nAlso, I saw a posting in a McGill BioC lab that's offering a post-doc position for $23/hr--a wage many of my friends currently in CS (who have not even graduated their bachelor's) topple with a summer internship. \n\nHonestly, I wish they did more symposiums featuring life-science McGill alumni that did not pursue further education (graduate or professional) talking about their career post-graduation! I would assume that most BSc graduates do not pursue further education and enter the workforce.", "subreddit_id": "t5_2rhkw", "created_utc": 1602991400}, {"subreddit_name": "mcgill", "author": "dairyqueen22", "id": "g96a4pj", "author_fullname": "t2_12mtzy2", "score": 1, "body": "Ah yes, congrats to the guy who got his education at an anglo publicly funded school, the exact type of school that he now wants to cut funding to. Lmao no, screw that guy. He's a hypocrite.", "subreddit_id": "t5_2rhkw", "created_utc": 1602990215}, {"subreddit_name": "mcgill", "author": "lilypad365", "id": "g95xfkl", "author_fullname": "t2_3vsuog3k", "score": 1, "body": "have you not tried his dogs? they are heavenly. i say this as a vegetarian who loves the vegan dogs, delicious faux meat is hard to find.", "subreddit_id": "t5_2rhkw", "created_utc": 1602983432}, {"subreddit_name": "mcgill", "author": "FUCK_TheMathFailedUs", "id": "g95k5lf", "author_fullname": "t2_n5gk24l", "score": -1, "body": "They aren't going to reply to any Armenians or rather any individual who attempts to debate the actual conflict because they don't want to debate the actual conflict. They would rather debate whether or not the SSMU should take a position in such conflicts. By engaging with anyone in the actual political conflict would just derail the purpose of the actual post.", "subreddit_id": "t5_2rhkw", "created_utc": 1602976769}, {"subreddit_name": "mcgill", "author": "Reddit_cilisi", "id": "g9503pk", "author_fullname": "t2_63vgawb1", "score": 1, "body": "Maybe doesn't have to be snail mail? Could you scan it and send it to her by email? If it goes to her McGill pigeonhole who knows when she'll see it.", "subreddit_id": "t5_2rhkw", "created_utc": 1602967133}]}