{"data": [{"subreddit_name": "Concordia", "author": "peepeepengu", "id": "g93x4k5", "author_fullname": "t2_56eqojtt", "score": 1, "body": "I don’t think all exams uses COLE... my prof just made us go on zoom and open our cameras and he supervise us haha", "subreddit_id": "t5_2rsnl", "created_utc": 1602947067}, {"subreddit_name": "Concordia", "author": "Volkov07", "id": "g8vaax8", "author_fullname": "t2_g6vsd", "score": 1, "body": "Its a gigantic fucking mess. I just graduated this past semester and while it was rough, I really feel for you guys as things definitely haven't improved.   Unfortunately Concordia teachers have been acting like snakes, thinking that students now have more free time to do work. One of my last classes had an absolutely heartless bastard who made the procedure for the final exam as hard as possible. One poor guy in the zoom session was on the verge of tears and the prof gave him the most smug looking expression.\n\nAll I can say is, you're halfway there. While it will feel like a mess for the foreseeable future, you're closer now than you've ever been and you can pull this off. Don't let those bastards get the better of you. Which engineering are you? PM if you need to talk or need help with classes.", "subreddit_id": "t5_2rsnl", "created_utc": 1602735224}, {"subreddit_name": "Concordia", "author": "MegazardY117", "id": "g8v940y", "author_fullname": "t2_10lppi", "score": 3, "body": "Our prof this morning was actually chewing out the class for daring to email him asking when the midterm is. I was about ready to punch the screen zoom was on", "subreddit_id": "t5_2rsnl", "created_utc": 1602734336}, {"subreddit_name": "Concordia", "author": "iwearstripedshirts", "id": "ga6ehyk", "author_fullname": "t2_lc5z1i", "score": 1, "body": "I haven't had an issue with the time running out or anything, I've had over 2hr zoom sessions on it", "subreddit_id": "t5_2rsnl", "created_utc": 1603728034}, {"subreddit_name": "Concordia", "author": "GryphticonPrime", "id": "ga60yb7", "author_fullname": "t2_venco", "score": 1, "body": "Sounds like how Concordia is handling things, minus Proctorio. So in that sense, you guys have it much better. Proctorio is the centerpiece of my worries, and things would be so much better without it. Yes, I would take Zoom proctoring anyday over Proctorio. In fact, I have no problem with Zoom proctoring since it's the same as being seen in class.", "subreddit_id": "t5_2rsnl", "created_utc": 1603720896}]}