{"data": [{"subreddit_name": "Concordia", "author": "Tribidoul", "id": "g9kpuem", "author_fullname": "t2_6ywk21zp", "score": 1, "body": "Don’t bother.\n\nFrench is the language of losers; they lost the war, so they are an inferior people. It's not for nothing that the English rule here, they are a lot better people with a much better language.\n\nIf you are told to speak French, make sure that you point out that you are in Canada, in which we speak English, and that you don't have to speak a loser language. Then conclude with \"speak white\", those frogs will know instantly you mean business.", "subreddit_id": "t5_2rsnl", "created_utc": 1603310352}, {"subreddit_name": "Concordia", "author": "Makestuffs", "id": "g9a1k3q", "author_fullname": "t2_2gsk4i63", "score": 1, "body": "I was in the same position as you before I started playing tricks on my brain to fix the quarantine procrastination. \n\nI recommend waking up every day with the idea that you are going to have to leave the house, even if you do not. Make your bed and clean your room, the clutter instantly puts you in a bad mood, shower, wear clothes that you would wear outside, that means shoes in the house, trust me it makes a huge difference in your mind when you're in jeans and shoes v/s sweatpants and flip flops. Also, designate a spot in your room/apartment where you cannot have your phone with you or browse the internet, it makes it much easier to study. I found that I would be more motivated to work if I decided I would reward myself with Netflix or any other self-indulgent behavior, only once I completed XYZ! It makes everything so much more satisfying cause there is no more guilt associated with the act. \n\nYou have to literally go to war with yourself, call yourself out when you're being a lazy shit, it's not easy but I'm telling you it's 100% possible if you keep trying!\n\n **I'M ROOTING FOR YOU!**", "subreddit_id": "t5_2rsnl", "created_utc": 1603068768}, {"subreddit_name": "Concordia", "author": "KruSion", "id": "gansq2y", "author_fullname": "t2_evtxw", "score": 1, "body": "Hey. I'm also doing my graduate studies. About to graduate this semester... i can relate so much to what you're going through. I've had that same hit when I started undergrad. You're in the exam, you're almost shivering,  surprised by what you're seeing and what's happening. It's like a dream. \n\nDon't let it get to you. This is only a battle and not the whole war. You can still come out and make the most of it. Graduate studies was never about the GPA, it's about the experience that you get out of it. This is part of the experience. You've been knocked down. It's okay, you're not invincible. The trick is to get back up. Learn from your mistakes and continue the fight. Find out where you went wrong and try to work on or fix. It's easier said than done. In your place I felt overwhelmed. But it gets better with time. \n\nWith last semester, i kept getting these panic attacks. When things were just not working. I found something that worked for me. Might not be the same exact thing that will work for you. You gotta find your safe zone to gather your thoughts and continue your work. \n\nObviously so many other people have offered to help and I'm extending my hand too. Whenever you want to talk, vent, need some guidance. Hit me up. \n\nI'm not invincible either. But I do have some time on me this semester and definitely wouldn't mind helping you out a little.", "subreddit_id": "t5_2rsnl", "created_utc": 1604108332}, {"subreddit_name": "Concordia", "author": "lujykalo", "id": "gac60w5", "author_fullname": "t2_4igfgejk", "score": 1, "body": "took the words right out of my mouth, i also came from country of war and I completely sympathize w u.. this really does suck and they put the blame on u :') really breaks my heart", "subreddit_id": "t5_2rsnl", "created_utc": 1603849255}, {"subreddit_name": "Concordia", "author": "youtrynnareadmyname", "id": "gcy00lp", "author_fullname": "t2_erg6oco", "score": 1, "body": "il est difficile d'être le roi de la France", "subreddit_id": "t5_2rsnl", "created_utc": 1605883255}]}