{"data": [{"subreddit_name": "montreal", "author": "rightful_hello", "id": "hs9wkhy", "author_fullname": "t2_4e3va6qz", "score": 1, "body": "I'll look into it. I'm planning on having a family in a few years, so I guess Imma try to tolerate this a bit and if it get's worse, I'm out of here.\n\nAlso, was nice talking to you. I'm glad that it didn't turn into a war of insults. This convo was simply 2 people disagreeing on a topic.\n\nTbh I hope you have a nice day and let's hoper that", "subreddit_id": "t5_2qnmr", "created_utc": 1641942797}, {"subreddit_name": "montreal", "author": "CriticalMessage9729", "id": "hs9m7j0", "author_fullname": "t2_3b4ddebi", "score": 1, "body": "Clearly you miss the point, I cannot sit hear wasting my time tying to explain why this is a major human rights violation and identical to what Hitler did to the jews In the 1930's. Canada's health system has been in shambles for years , what the media and government is doing is demonizing a small group of people who are hesitant or question the government and big pharma  (for damn good reasons, tobacco, asbestos in baby powder j and j, 2.3 billion dollar lawsuit pfizer) blaming them for our lockdowns and economic disaster instead of focusing the blame where it belongs the Canadian government. First you divide the people then you conquer them , ceaser did this as did Hitler. Hitler blames the jews for the loss of the war and the depression and offered a final solution. \n\nThese people are taking up space , how long do we tolerate them? We need a final solution- Adolf Hitler \n\nUnvaccinated are often racist, deny science , mygnmostic, I have to ask myself as a leader do we tolerate these people?? - Trudeau\n\nFact is the Canadian healclthcare system and our government have failed and they are deflecting creating a stereotypical enemy ( the unvaccinated , or the jews in Hitler case) to further implement their plans as well as divide the people first u divide then conquer. Having us focused on left right wing beliefs and vaxxed or uncaxxed keeps out eyes off if the real enemy the government. What you are seeing is the beginning of an authoritarian regime in Canada , using the covid 19 crisis to their advantage. Remember they simulated a coronavirus pandemic in Oct 2019 at event 201 , so they are lying when they say no one prepared for this it is going exactly as they planned it would.\n\nShow some compassion,  vaccine injurys although rare do happen . If someone you loved was seriously injured by a vaccine you would be hesitant too, also the manufacturer would hold zero liability and you would not be covered financially. These things can never be forced in a free society, but at the end of the day they are using your fear to create a worldwide digital id social credit system like China, do as your told or else.", "subreddit_id": "t5_2qnmr", "created_utc": 1641938773}, {"subreddit_name": "montreal", "author": "gunnershabs", "id": "hs9ci9f", "author_fullname": "t2_8sjjrdag", "score": 1, "body": "This will lead to a civil war.", "subreddit_id": "t5_2qnmr", "created_utc": 1641935214}, {"subreddit_name": "montreal", "author": "contrariancaribou", "id": "hs8y6av", "author_fullname": "t2_3fiqf5gx", "score": 1, "body": "How many times has Legault gone around justifying any and all of his actions by simply saying \"I've got a majority mandate\"?\n\nDid he or did he not use the non-withstanding clause to pass through legislation that is clearly against the most basic Canadian and Quebec charter rights? \n\nLegault and Arruda have supported and used curfews as a public health measure with no next to no credible research that prove it's in any way effective. Curfews that they've both characterized as normally reserved for war time.\n\nJustifying political actions by pointing to a \"majority\" mandate , diminishing a constitution/protected civil rights, enacting repressive measures with little justification. That's not tending towards authoritarian for you?", "subreddit_id": "t5_2qnmr", "created_utc": 1641929975}, {"subreddit_name": "montreal", "author": "batmanshome", "id": "hs8sp0p", "author_fullname": "t2_ic641", "score": 1, "body": "Not at all. We live in a communal society. We share everything. Even risks. \n\nDo you think at a time of war the government will respect your wishes not to be drafted? Wake up.", "subreddit_id": "t5_2qnmr", "created_utc": 1641927952}]}