{"data": [{"subreddit_name": "Concordia", "author": "eatmy-dust", "author_fullname": "t2_2tm8ul2x", "id": "jdabac", "score": 1, "selftext": "I’m an engineering student and sometimes having a good TA can make all the difference when the prof isn’t very good at explaining. However, what really sucks is when you have both a bad prof and a bad TA. I know that there isn’t much we can do about replacing bad profs but for the TA’s or aspiring TA’s, please think about how your teaching will affect students. Sure, making money being a TA is cool and all but if you can’t teach, please do not sign up for this! You guys know who you are! I have TA’s who actually act like they don’t care and just want to get the class done and over with. Please think about the students, there are other jobs you can find that don’t involve teaching.", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20352, "created_utc": 1602997128, "num_comments": 10, "title": "A Message for Future TAs", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "Jarash2018", "author_fullname": "t2_1qqnfkve", "id": "jd8443", "score": 1, "selftext": "So I am an international student doing Meng, it is my final semester. In one of my courses that I am taking the final exam is for 70% of the total grade. So if, for any reason I did not do well, I will get F, or C and I will be dropped out of this university. Then, for sure I am going to commit a suicide. \n\nAnd to add insult to injury, this prof DOES NOT SPEEK ENGLISH, his accent is so hard to be understood, and he makes a lot of grammatical mistakes. None of my classmates ask questions during a 3h long lecture, none of us has a clue about what is he saying.   \n\nIs it logical that all of my future will be dependent  on just one final exam? Of course I will be super stress! \n\nThere are some profs who want you intentionally to suffer and struggle, they enjoy seeing students suffering.\n\nIf I get C or F I will kill myself!", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20349, "created_utc": 1602987542, "num_comments": 3, "title": "A final exam for 70% of the total grade", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "concordiastu455", "author_fullname": "t2_8hca90rs", "id": "jd4uji", "score": 1, "selftext": "**tldr**: Concordia hasn't processed my  student loans, so I can't afford tuition or my rent. So I have to leave the country. And profs will penalize me for late assignments during my move-out week. On top of that I'm expecting I will be charged late fees for my tuition.  \n\n\nI just can't anymore with this university. I'm tired of being shuffled around from admin person to admin person only to get nowhere. I'm an international (US) student and I currently have to move back home this week because I can't afford to pay $400/month for my apartment anymore. And I'm lucky to be one of the privileged students who are even able to move back home at this time...\n\nThe Concordia Financial Aid office still hasn't processed my student loan application, so I still don't know if I qualify for any loans this year. They told me in August that I would only have to wait 3-4 weeks to get an answer. It's been 2 months. I write polite emails to admin, I follow-up, but I still don't get concrete answers.\n\nhttps://preview.redd.it/98afv7mcgqt51.png?width=600&amp;format=png&amp;auto=webp&amp;s=27e6089425087f3cebcc8eba0ba0a129259b0624\n\nhttps://preview.redd.it/nxkkwzphgqt51.png?width=700&amp;format=png&amp;auto=webp&amp;s=814c93f10e9734b3781ca71c80d42b778248f92f\n\nI work part-time as an undergraduate Research Assistant at Concordia. And I truly love my job.  But it is by far not enough money to support my monthly rent, let alone my tuition.\n\nI don't receive any sort of Covid-19 relief because I am not Canadian and the US government is still tied up in stimulus bill talks and probably will be until long after the November election.\n\nWhat really pushed me over the edge today was the response I got from a prof after asking for an extension for an assignment. I am overwhelmed because I have to move back to the US on Thursday and therefore won't be able to complete the assignment by the end of next week. The prof acknowledged that due to my circumstances I have no choice but to hand the assignment in late, but he made it clear I will still lose a whole letter grade every day it is late. \n\nIt just doesn't feel like the profs are sympathetic to the situation at all. And it's surprising because I know this situation can't be easy for them either. But things can get very bad for their students and I guess I foolishly hoped for a bit more empathy and understanding.\n\nI've been an active member of the Concordia community for many years. I've been a student representative, and I've been an active part of multiple student clubs on campus. But now I'm just so tired of caring about a school that clearly does not care about me at all.\n\nI'm at my wits end y'all. I'm exhausted.", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20339, "created_utc": 1602974743, "num_comments": 10, "title": "At my wit's end with this school...", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "Expensive_Music9591", "author_fullname": "t2_7d051kln", "id": "jd2q6i", "score": 1, "selftext": "This semester has been getting worse and worse. I have been doing 5 classes last fall, winter and summer, didn't struggle but this semester its getting out of hand. I have been extremely depressed and my anxiety is making me feel like my brain is gonna implode. I am one of those people who falls asleep when things get too much, my body literally collapses. At this point i can sleep for 24h+ straight because my body can't keep up. It's not mental anymore, I can feel my body slowly deteriorating. I am having very serious memory issues where i'm not able to remember everyday things. The work load this semester feels so much more because we are obviously having to be a student AND a teacher to ourselves at the same time. Which is unacceptable in my opinion, I'm seeing zero effort from most of the teachers...   \n\n\nI don't know where to get help as i don't have a family doctor, can't visit a hospital since my issue will probably be brushed off, or get a doctor now because of Covid and we all know how bad the university psych services are (I have been there, it made me feel worse). My mind is spiralling now. Im not sure why Im writing this. I cant be the only one, Am i?", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20336, "created_utc": 1602967222, "num_comments": 11, "title": "Not sure how to get help, semester is getting worse and worse (from an Engr. student)", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "TheGodfather7100", "author_fullname": "t2_1jpi9cl1", "id": "jcujnf", "score": 1, "selftext": "Hey guys,\nI am a third year mechanical engineering student that wants to apply for Meng at concordia.\nI was told that students who want to apply for MASc should contact a supervisor before submitting their application.\nIs it also the case for Meng? Should I contact any professor during the application process?\nThanks", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20319, "created_utc": 1602938953, "num_comments": 1, "title": "Meng mechanical engineering", "upvote_ratio": 1.0}]}