{"data": [{"subreddit_name": "mcgill", "author": "Imaginary-Listen1134", "id": "g96mikj", "author_fullname": "t2_7rlmogor", "score": 1, "body": "I know how you feel keep it up. Going at McGill gives you the warrior status", "subreddit_id": "t5_2rhkw", "created_utc": 1602997153}, {"subreddit_name": "mcgill", "author": "Ghostofgeoffrey", "id": "gdildht", "author_fullname": "t2_35702ctg", "score": 2, "body": "warrior", "subreddit_id": "t5_2rhkw", "created_utc": 1606273888}, {"subreddit_name": "mcgill", "author": "matfloeno", "id": "ge74p8x", "author_fullname": "t2_88poe62u", "score": 0, "body": "Oh no I'm not talking to minorities I'm talking to everyone, I do talk more specifically to the social justice warrior type it's true. I completely agree with you jesus christ I didn't know they received 30k. I lowkey want to start a petition lmao. You've got some good ideas you should apply to be part of the ssmu and stop them from doing stupid things and wasting money.", "subreddit_id": "t5_2rhkw", "created_utc": 1606776439}, {"subreddit_name": "mcgill", "author": "Fuel-Dangerous", "id": "ge64o51", "author_fullname": "t2_8uad98vx", "score": 1, "body": "Other facts:\n\n- Mccool was removed from his elected position with a $35,000 salary.\n\n- The SSMU committee made a judgement of guilt respecting an incident without addressing the specifics of the incident.\n\n- Hours later, the McGill paper published a story referring to Mr. Mccool as a sexual predator.  Confidentiality?\n\n-  2 days later, the student making the allegation published a story of their own.\n\n-  The university was asked to get involved but chose not to intervene in a possible rights violation.\n\n-  A lawyer selected and hired by the SSMU review led the case, sided with Mr. McCool, and cited numerous concerns with the SSMU process.\n\nQuestions:\n-  Does the SSMU have a privacy issue by violating McCool’a right to confidentiality during an ongoing process.\n\n-  Does the SSMU even have the authority to adjudicate this type of allegation? (That would be no)\n\n-  What blame should the accuser assume?  Her statement in the McGill paper reads more like a social justice warrior manifesto than a truly personal account.  \n\n-  What blame does the university assume here for allowing Mr. McCool’s reputation to be publicly damaged by all this?  I think the university should bare responsibility for choosing to let all this continue.", "subreddit_id": "t5_2rhkw", "created_utc": 1606759614}]}