{"data": [{"subreddit_name": "Concordia", "author": "Sefyuuu", "author_fullname": "t2_7btuc9ov", "id": "jbs4gv", "score": 1, "selftext": "Hi guys i cannot access my moodle can anyone give me the zoom link for 361 with gomaa thanks !!", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20263, "created_utc": 1602782980, "num_comments": 0, "title": "URGENT NEED zoom link for 361 with gomaa", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "jazzattackk", "author_fullname": "t2_4uvm6vty", "id": "jb6nrz", "score": 1, "selftext": "Hi everyone! \n\nis anyone here enrolled in soci 280? If so have you attempted the quiz for class 6? I just attempted to do this, with only one attempt and no refreshing of the page. For someone reason I could only zoom in and out of the map, but was not able to drag or add the aboriginal nations to the territory on the map. I mailed the teacher immediately to tell him, since there was a 20 minute timer. Still no reply...anyway, I want to know if I did something wrong, or if anyone else had this issue.", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20229, "created_utc": 1602700740, "num_comments": 1, "title": "Soci 280 Quiz this week - eConcordia class", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "selfinjurymmrl", "author_fullname": "t2_8ju9bmrv", "id": "jhz6fr", "score": 1, "selftext": "https://preview.redd.it/fpjk7082jav51.jpg?width=1687&amp;format=pjpg&amp;auto=webp&amp;s=17548b188fc54257e859a0f0648afac0b87d7ff3\n\nThe McGill Mindfulness Research Lab (MMRL) is looking for participants for a study assessing the effectiveness of a new, mindfulness and self-compassion group treatment for people who self-injure. Treatment sessions will be approximately 2 hours long and occur weekly online via Zoom. Participants will be compensated for completing questionnaires. You may be eligible to participate if you are at least 18 years old, currently reside in Canada, and currently self-injure. Please do not comment below. If you’re interested in learning more about the study, please contact [**selfinjury.mmrl@gmail.com**](mailto:selfinjury.mmrl@gmail.com).   \n \n\nPrincipal Investigator   \nEmma Schmelefske   \nEducational and Counselling Psychology [**emma.schmelefske@mail.mcgill.ca** ](mailto:emma.schmelefske@mail.mcgill.ca)  \nSupervisor   \nBassam Khoury   \nEducational and Counselling Psychology [**bassam.el-khoury@mcgill.ca**](mailto:bassam.el-khoury@mcgill.ca)", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20566, "created_utc": 1603653361, "num_comments": 0, "title": "Mod Approved: Novel Mindfulness Methods Study for Treating Self-Injury (18+ Living in Canada)", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "geek_comp", "author_fullname": "t2_11endduy", "id": "jg99wo", "score": 1, "selftext": "Is it just me or the work load for Morales' classes (SOEN384-343) is absolutely crazy?\n\nSure, it's nice to not have a final but having tutorial assignments both due on the same day with quizzes and deliverables is seriously ridiculous. It doesn't really help that we don't have live Zoom lectures for questions. Yeah he has office hours, but hosting live zoom lectures is essential too. All my other courses post video lectures on Moodle but they also do live q&amp;a which is beneficial for everyone. Writing on the Forum doesn't really help because sometimes he doesn't clearly understand the question that is posted.  I encourage you to complete the midterm feedback he posted on Moodle if you feel this way.", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20491, "created_utc": 1603402740, "num_comments": 1, "title": "3rd SOEN student workload", "upvote_ratio": 1.0}, {"subreddit_name": "Concordia", "author": "eltrupin10", "author_fullname": "t2_1ybipfkh", "id": "jfqv65", "score": 1, "selftext": "Frustration, what does it actually mean? \n\nA few signs are to: \n\n* Get angry.\n* Give up or quit.\n* Lose self-esteem.\n* Feel a loss of self-confidence.\n* Experience stress.\n* Feel sad, uncertain, depressed or anxious.\n\nThose are some of the feelings I have since the beginning of this Summer 2020 semester. I'm aware COVID caused a lot of negative circumstances around the world. People got severely sick, lost friends and loved ones, some businesses have closed down, some lost their jobs and the list can go on. We live in difficult times that no one expected such event to happen. \n\nThis might see as I'm complaining but I need to vent out.\n\nWe the students and workforce of the future are facing confusing and frustrating moments at Concordia, or home since everything is on Zoom, and maybe other university students around the world feel the same. All I see on different Concordia Facebook pages are students complaining, stressed, anxious, depressed and mostly frustrated. Frustrated that the school doesn't have ANY sympathy towards their students. Being a full time student glued to my chair, in my room in front of the computer for 10+ hours a day is frustrating. I understand that no one asked for this to happen but something really needs to be changed! \n\nI have \"teachers\" that don't teach, they waste our time (other students I spoke to feel the same). For example, some of my colleagues throughout my courses ask straightforward questions regarding assignments and projects, these \"teachers\" can't clarify exactly what they ask of us. I decided to pursue business as a career and learn from knowledgeable instructors. I'm expecting to have clear communication between instructors and students, not leave us confused at what exactly needs to be done. \n\nOne of my teachers takes 15 minutes to answer a simple straightforward question by giving martial arts metaphors and tries to be seen as if he was super knowledgeable. A lot of students, including myself, had a 30 minute quiz to answer 40 multiple choice questions. Why did I even bother studying for that quiz? I didn't know I was supposed to mentally calculate the time to answer all question under 45 seconds when they were almost a whole paragraph to read. Where's the time to analyze and think back  to what we learned from our **self-learning?**\n\nAnother teacher I have gives a 3 hour class talking about whatever we are supposed to face in the business world. I'm paying my studies with my hard earned time and money for an instructor to teach me how to dress as a business man for 3 hours long? Is this serious? There's YouTube (watch Alpha M he's got good stuff on fashion) and Instagram and its FREE. According to RateMyProffesors website, a lot of students left warnings on not to rely on his lectures because they are USELESS for the final exam. But we can't just skip class because we need to be there for participation marks. I'm sure this is not the only course there is like this. A complete joke. \n\nTeachers posting deadlines after deadlines without sympathy, without acknowledging our mental health. Almost everything is closed, gyms are closed and it's one of the only places I go to get rid of my stress. Concordia needs to change. I'm tired of being glued to my chair catching up with material that I have to completely self teach myself because a lot of teachers and \"Drs\" don't know how to interact and give a proper lesson. Is THIS what university is really all about?\n\n&amp;#x200B;\n\nI can keep going but I'll never finish writing. \n\nThanks for reading.  \n\n\n \\*Your fellow Concordian learning how to dress as a business man.", "subreddit_id": "t5_2rsnl", "subreddit_subscribers": 20474, "created_utc": 1603332594, "num_comments": 8, "title": "Frustrated at Concordia and \"Education system\". Am I alone?", "upvote_ratio": 1.0}]}