{"data": [{"subreddit_name": "mcgill", "author": "popupthought", "author_fullname": "t2_3yjux49w", "id": "jdb4rp", "score": 1, "selftext": "", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30073, "created_utc": 1603001200, "num_comments": 0, "title": "Had an interview with a professor whose lab I really love and want to join for my Graduate studies. I took a screenshot of our zoom call together and saved it on my desktop. I'll know the results in 2 weeks! 🤞", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "vigilant_dog", "author_fullname": "t2_1tb59yd6", "id": "jb4l9h", "score": 1, "selftext": "It seems crazy to me that testing like this is allowed. There have to be people doing tests together over FaceTime, Zoom or even in person which inflates the averages. I feel beat. I have no confidence in my ability. I don’t even know how I’m doing with respect to the rest of the class cause there are people doing tests together.", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 29995, "created_utc": 1602694678, "num_comments": 28, "title": "How am I supposed to keep up with the class averages while people are cheating.", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "andreasharford", "author_fullname": "t2_13wcjz", "id": "j9duyv", "score": 1, "selftext": "", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 29954, "created_utc": 1602451499, "num_comments": 8, "title": "Me sitting down for dinner at 12:07am after 3 hours of back to back zoom lectures", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "AnonNo125", "author_fullname": "t2_39r35ip1", "id": "jm88t7", "score": 1, "selftext": "I'm in my last year of the honours program.\nIn most honours courses, we covered less material than in non-honours courses but had more difficult assignments.\nWe barely covered material relevant to the industry, or rather we barely scratched the surface, and that shows in the interviews.\nThere were no opportunities for working in groups on larger projects.\nI have not made any significant human connection either, which is noticeable and contributes to me having an unremarkable candidate profile when applying for jobs in the industry.\n\nI could not land an internship last year during the tech fairs and online applications, and even then it would probably have been cancelled due to COVID.\n10% of the faculty gets 4.00 year round and I'm not among them.\nZoom university may depreciate further the value of my diploma.\nBy fear of losing another opportunity, I feel coerced into a master's program that really won't be relevant in future applications to the industry.\nI still have to write a personal statement for that application and need to find something other than \"I don't want to starve to death\" as a motivation for wanting to take higher-level courses that maybe will help me land a job someday.\n\nThere is no guarantee that I will get into grad school, and come May I'll be on my own, with no opportunity of growth apart from unremarkable side projects on Github.\nThe computer science and software engineering programs overlap too much for me to actually gain something from going back to undergrad studies in software engeineering.\n\nAm I specifically fucked, or is that a feeling shared with other computer science undergrads here at McGill?\nIf not, then how can you break out of the loop of not having experience and requiring a job to get that experience, all the while not having any connections?\nIs having completed the undergraduate program that much more valuable to recruiters?", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30407, "created_utc": 1604258750, "num_comments": 13, "title": "What to do after B.Sc. Major Computer Science?", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "andreasharford", "author_fullname": "t2_13wcjz", "id": "jkmgck", "score": 1, "selftext": "I can't stress how much I love this class. Baldwin is a sweetie and makes concious efforts to shorten his lectures, cancel conferences and even whole lectures when we all have a ton of work. He brings his dog onto the lecture sometimes to cheer us up and I love his little personal anecdotes that he works into the lecture content. \n\nOur TAs are also gems, the course content is interesting, and our class have a ton of fun on the zoom chat with each other. This class is one of the bright spots of my week :')", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30340, "created_utc": 1604017637, "num_comments": 7, "title": "Professor Baldwin (PSYC215) appreciation thread", "upvote_ratio": 1.0}]}