{"data": [{"subreddit_name": "montreal", "author": "eric_bousquet", "author_fullname": "t2_86u2e1pq", "id": "slg72r", "score": 1, "selftext": "", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 188165, "created_utc": 1644093848, "num_comments": 2, "title": "Dawson College students, staff say everyone loses when CEGEP becomes pawn in Quebec language war. “The decision robs the health-care system of a planned student-run medical clinic that would've served thousands of patients each year.”", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "imhere8888", "author_fullname": "t2_il01f0qj", "id": "st7yuu", "score": 1, "selftext": "i used to think it was the weather but after spending the last year in ottawa its really not. there is an almost immediate noticable decrease in road quality as soon as you cross the quebec border. and montreal is just the pinnacle of it all with poor traffic decisions still only city where there is no right on red lights that make cars turning right stand still for 510 seconds waiting for ghost pedestrians some lights giving right of way to ghost busses for nearly 1520 seconds not being able to turn left on way too many streets poor signage everywhere poor to no indication a road up ahead will be blocked. mixed with very slow borderline incompetent construction projects but really despite all this why does it feel like im driving through a war torn third world country where mines have recently exploded everywhere. we dont need speed bumps anywhere in the city right now you literally cant drive fast or you will destroy your car by hitting some of these craters. sherbrooke street is comical. but its really everywhere there is no point to call some areas out. i called 311 for some that are egregious and i asked \"is it even worth it to call for potholes.\" and they assured me they will fix them if they are particularly dangerous. but seeing how they fix them and the results of \"fixed\" roads. bumps everywhere. again ontario is not different weather. but if i saw a pothole there it would be patched very soon and the result was a smooth street you could roller blade or skateboard on. try getting a smooth existence on our roads. which brings me back to my main question. what is the reason its like this here. why is the the actual quality of the roads so poor. what is the culture that has allowed this type of workmanship to be ok. all respect to the city workers and construction people but who signs off on some of these \"repairs\". why is this standard of roads acceptable. its not. yet somehow it is. i guess its a mix of using poor which the gov should intervene and mark as unacceptable material but also the workers themselves probably dont feel any need pride or pressure to actually do good work because \"look how horrible it is everywhere else they still got paid why should i spend time and effort making it clean smooth and nice.\" there is something very wrong on many levels for our roads to be like this. what is our way out. what are some solutions.", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 189957, "created_utc": 1644945352, "num_comments": 311, "title": "why is the road quality so poor.", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "Drakenstair", "author_fullname": "t2_3ikkvzx6", "id": "t3tsir", "score": 1, "selftext": "Désolé d'avance pour ce post lugubre. English version at the bottom; I understand if you feel the need to downvote because you think it's exaggerated bullshit, but please comfort me in the comments if you do!\n\n&amp;#x200B;\n\nAllô tout le monde. J'suis un jeune à l'université; c'est la première fois que je soumets un post au subreddit de Montréal. Habituellement, j'suis une personne positive avec très peu de stress dans ma vie personnelle; par contre, mon anxiété a dernièrement atteint des niveaux record dans le contexte de l'attaque sur l'Ukraine par la Russie. Mon anxiété est complètement égoïste dans ce contexte: c'est la possibilité qu'une arme nucléaire nous atteigne qui me préoccupe. Il y a tellement de souffrance dans le monde - par contre, j'ai l'impression que la plupart d'entre nous sont capables d'oublier cette réalité et de vivre notre quotidien sans avoir des pensées vraiment existentielles. C'est horrible de le dire comme ça, mais c'est honnêtement ce qu'on fait.\n\nJe viens de visionner la vidéo de Kurzgesagt [\"What if We Nuked a City?\"](https://www.youtube.com/watch?v=5iPH-br_eJQ&amp;ab_channel=Kurzgesagt%E2%80%93InaNutshell) (I highly recommend the watch if you enjoy depression) et ça m'a fait penser à une question plus ou moins concrète.\n\nImaginez que la ville entière est réveillée à trois heures du matin par une alarme sur nos cells qui ressemble à celle de nos alertes \"Amber\"; après qu'on ait rapidement parcourut le petit paragraphe de l'alerte, on réalise qu'on nous prévient du début du premier conflit nucléaire.\n\n**Quelle est votre premier réflexe pour vous sauver, vous et votre famille/amis?** Personnellement, je n'ai jamais pris la peine de m'informer des protocoles propres à Montréal pour se protéger d'un désastre naturel ou d'une attaque avec des bombes (supposant que ce genre de protocole existe?). Et je parle pas nécessairement de la guerre civile éventuelle pour s'approprier les Costcos et la bouffe dedans, mais plutôt de votre réaction dans le moment pour ne pas immédiatement être pris dans un blast nucléaire potentiel. On se pitche-tu dans les tunnels de métro pour éviter les impacts des explosions et les quelques jours de pluie nucléaire?\n\n&amp;#x200B;\n\nHey all. I'm a student in university; this will be the first time that I submit a post to Montreal's subreddit. I'm usually a very positive person with close to no stress in my personal life; however, my anxiety has recently reached sky-high levels in the context of Russia's attack on Ukraine. My anxiety is completely selfish within this context: I'm deadly afraid about the possibility of a nuclear weapon being dropped on us. There's so much suffering in the world - yet, I think most of us are able to forget this reality and live our daily lives without having many existential thoughts. It's horrible to just say it like that, but it's honestly what we do.\n\nI just watched Kurzgesagt's video [\"What if We Nuked a City?\"](https://www.youtube.com/watch?v=5iPH-br_eJQ&amp;ab_channel=Kurzgesagt%E2%80%93InaNutshell) (je vous recommande fortement de le visionner si vous aimez être déprimé) and it made me come up with a more or less concrete question.\n\nImagine that the entire city is woken up at three in the morning by an alarm on our cells that sounds like the one from our Amber alerts; after we've all quickly skimmed the short paragraph of the alert, we realize that we're being warned about an impending nuclear conflict.\n\n**What would be your first reflex to save yourselves, your families, and your friends?** Personally, I never tried to learn about any protocols developed by Montreal about protecting ourselves from natural disasters or a major bomb attack (assuming any protocols like that exist?). And I'm not necessarily talking about the eventual civil war to capture the Costcos and all the food inside, but rather your reaction in the immediate moment to not get caught in a potential nuclear blast. Are we all supposed to crowd the metro tunnels to avoid the impacts of the explosions and the couple days of nuclear rain?", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 192539, "created_utc": 1646092655, "num_comments": 58, "title": "On fait quoi si Montréal est menacé par des armes nucléaires? What are we supposed to do if Montreal is threatened by nuclear weapons?", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "Revolutionary_Web964", "author_fullname": "t2_a588gls7", "id": "t2tsl4", "score": 1, "selftext": "[removed]", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 192253, "created_utc": 1645984744, "num_comments": 0, "title": "EVENT Ukraine: How to Oppose Imperialist War", "upvote_ratio": 1.0}, {"subreddit_name": "montreal", "author": "alexkent_200", "author_fullname": "t2_9hqccryl", "id": "t0o526", "score": 1, "selftext": "me and my fellow tatars that i study with at cegep we are effing blown away. i open casually news to read and what i see there the last bit of sanity vanished. invasion war. to prove what.. im left speechless. like oh holly hell and thy kingdome come russia has got nothing else to do and to work on other than muscle flexing.. i feel ashamed i used to be proud of being russian for like being stoic reserved and our accomplishments but i have a big effing matrix glitch right now happening. i dont know whether there is anything left to be proud of in this russian nature of mine. other than maybe writers painters composers. which are all things of the past. the past long gone. sorry my fellow ukranians for us not having any control over our government at any point in history. we did it to ourselves and we did it to you as a result. please dont hold us responsible. ampx200b its just plain pizdec.", "subreddit_id": "t5_2qnmr", "subreddit_subscribers": 191638, "created_utc": 1645743956, "num_comments": 1, "title": "as a russian im ashamed today to be russian", "upvote_ratio": 1.0}]}