{"data": [{"subreddit_name": "mcgill", "author": "Hoker7", "id": "g8simag", "author_fullname": "t2_51yk81sc", "score": 1, "body": "I think I actually got that description from my friend who referred to his YouTube mush! I definitely had a cycle of YouTube mush for a while, watching those formulaic Top 10 videos... If I want to sleep / zone out now, I stick on an audio book (got through the whole Harry Potter saga and two of ASOIAF so far), history podcast etc. and set a timer for 15 minutes. Ken Burn's The Civil War and some of his other stuff with that narrator are super relaxing!", "subreddit_id": "t5_2rhkw", "created_utc": 1602680439}, {"subreddit_name": "mcgill", "author": "Dat_Communist_Boi", "id": "g9pifu0", "author_fullname": "t2_12p9tg", "score": 8, "body": "All of this list is from my personal experience of drinking bubble tea! Please don't start a war over which place is the best/worst :) \n\nL2 is eh\n\nPresotea is good\n\nNos Thes is good\n\nChat time eh/good\n\nCocobun's bubble tea is bad, but everything else is amazing \n\nKabiga The is good \n\nThe Alley is eh (I tried it multiple times and hated it each time)", "subreddit_id": "t5_2rhkw", "created_utc": 1603413089}, {"subreddit_name": "mcgill", "author": "IAMApsychopathAMA", "id": "g9mggtu", "author_fullname": "t2_gr1un", "score": 1, "body": "206 is an absolute war crime.  \nI'm growing to hate how mercilessly M133 is run and graded as well", "subreddit_id": "t5_2rhkw", "created_utc": 1603347502}, {"subreddit_name": "mcgill", "author": "ChickenMcChickenFace", "id": "g99gi57", "author_fullname": "t2_1ruqi9ca", "score": 1, "body": "Most countries legit don’t care about the war, idk why SSMU cares", "subreddit_id": "t5_2rhkw", "created_utc": 1603056706}, {"subreddit_name": "mcgill", "author": "77rorqual", "id": "g97ig87", "author_fullname": "t2_5tzeobu", "score": 1, "body": "What is the purpose of this post? I can't understand, like there are a lot of migrants in Montreal not only Armenians. \n\nIf you mean ongoing conflict between Azerbaijan and Armenia, yes I am also with the innocent Armenians that affected from the war. But it's never unilateral, there are also civilian Azeris killed. I am also with them.\n\nSo, I can't see your point mentioning Montreal.", "subreddit_id": "t5_2rhkw", "created_utc": 1603020235}]}