{"data": [{"subreddit_name": "mcgill", "author": "tajajaja", "author_fullname": "t2_5g19fybk", "id": "jd6vzi", "score": 1, "selftext": "I have ADHD and I’m dyslexic. My reading comprehension is fine but I’m so incredibly slow at reading that I scored the in the 7th percentile when tested. For those who don’t know what that means, just know that it’s really, really bad. \n\nI’m in a field that’s super reading heavy. It only works out cuz I spend 3-4x the amount of time on my readings as other students. I’m usually able to handle this but recently I just couldn’t. I couldn’t keep my eyes on the page. I couldn’t stop my train of thoughts. I was failing to recognize simple words and I had 7 other things I also needed to get done. Ultimately I just wasn’t able to do it within a timeframe that came anywhere close to reasonable and, one whole month later, I finally fucking read all the damn readings and picked the one I wanted. \n\nI didn’t think I was going to get any sympathy for this. I fully expected (and deserved) to lose marks but despite being super anxious I somehow managed to actually send my prof the damn email. \n\nI told him about how my ADHD and dyslexia have been making it really hard for me to, well, read. I threw in some self deprecation and several apologies. I fully prepped myself to get written off/penalized. Instead, I got the nicest possible reply and it warmed my heart. \n\nThis prof had voluntarily given me an extension for a different assignment I didn’t even ask for (but definitely needed), told me not to worry about this in the future and communicate my issues instead, and asked me if there was any else he could do to help me.\n\nWho does that? I ghosted for a month but was given a free extension anyway and then he offered to do even more!? It’s nice to see that this kind of tolerance exists and at a university level. \n\nThere’s been a lot of frustrated rants on here lately (understandably) and I thought my actually good prof experience might help spread some of the happiness I got out of it.", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30070, "created_utc": 1602982570, "num_comments": 21, "title": "I was finally able to send my teacher an email saying that I’d picked my presentation date - a task I was expected to complete over month ago...", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "tajajaja", "author_fullname": "t2_5g19fybk", "id": "jd05qp", "score": 1, "selftext": "I have a particularly amazing professor who has consistently gone above and beyond to help me. Are there any awards that I could nominate them for? Are there other ways (apart from awards) that I could show my appreciation? The class that they teach is very small (there’s only 3 of us) so I’m worried that there won’t be enough nominations to qualify them for an award (I’m in Arts). \n\nThis professor has literally broken the boundaries of wonderfulness and deserves something in return.", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30061, "created_utc": 1602958535, "num_comments": 16, "title": "I want to do something substantial to thank/reward a professor that’s been absolutely amazing this year but I don’t know what I can/should do.", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "pakdneoss", "author_fullname": "t2_6pawi42q", "id": "jczbwu", "score": 1, "selftext": "Hi all, I’m thinking of taking an intensive FRSL course next semester, but I am a little concerned since it’s delivered remotely. For those who are taking frsl course this semester, what’s the difficulty like? how much are you learning from it?\nAny input would be appreciated!!!", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30061, "created_utc": 1602955789, "num_comments": 3, "title": "Remote frsl courses?", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "jiahsus", "author_fullname": "t2_3sbj296n", "id": "jcymdg", "score": 1, "selftext": "Of all the tech issues I’ve had lately, I did not expect being locked out of MyCourses and my McGill email to be one of them.\n\nIt’s been about 24h, I’ve already contacted IT but haven’t heard anything from them. I don’t know who else to contact and I really need to access to my email as it’s my main form of correspondance for my campus jobs.\n\nAny suggestions?", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30061, "created_utc": 1602953433, "num_comments": 5, "title": "Account Blocked from Signing In", "upvote_ratio": 1.0}, {"subreddit_name": "mcgill", "author": "venushaze", "author_fullname": "t2_16071s", "id": "jckdw4", "score": 1, "selftext": "Hi there, I'm an undergrad student hoping to get some more research experience under my belt this year (I had a research internship in CEGEP where I spent the summer in a uni lab, but that's the extent of my experience). I'm currently taking a class with a professor who runs a really interesting lab and I'm just loving the content of the class he's teaching. I'm doing very well so far in the class too. I've looked into the prof's research as well as the kind of research that his graduates are doing in the lab and it honestly couldn't be more up my alley.\n\nThough I haven't interacted with the prof directly due to the lack of in-person office hours, I've been thinking of reaching out to him via email to ask if there are volunteer positions available in his lab. Is this an appropriate thing to do? If so, and to any students who have done this before, what should I include in my email? Should I attach a CV or transcript (given that I have a high GPA) to my email? Any input would be very much appreciated. :)", "subreddit_id": "t5_2rhkw", "subreddit_subscribers": 30053, "created_utc": 1602889995, "num_comments": 4, "title": "Is it appropriate to email one of my profs to ask if they have positions open in their lab?", "upvote_ratio": 1.0}]}